In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('/Users/olgazdanova/IDE/Skillfactory/Pandas/data/police.csv')
data.head()

,stop_date,stop_time,county_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,01:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2005-01-18,08:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,2005-01-23,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,2005-02-20,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
4,2005-03-14,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91741 entries, 0 to 91740
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   stop_date           91741 non-null  object
 1   stop_time           91741 non-null  object
 2   county_name         0 non-null      float64
 3   driver_gender       86406 non-null  object
 4   driver_age_raw      86414 non-null  float64
 5   driver_age          86120 non-null  float64
 6   driver_race         86408 non-null  object
 7   violation_raw       86408 non-null  object
 8   violation           86408 non-null  object
 9   search_conducted    91741 non-null  bool
 10  search_type         3196 non-null   object
 11  stop_outcome        86408 non-null  object
 12  is_arrested         86408 non-null  object
 13  stop_duration       86408 non-null  object
 14  drugs_related_stop  91741 non-null  bool
dtypes: bool(2), float64(3), object(10)
memory usage: 9.3+ MB

In [7]:
data.drop(data.isnull().mean().sort_values(ascending=False)[0], inplace=True)

county_name           1.000000
search_type           0.965163
driver_age            0.061270
driver_gender         0.058153
driver_race           0.058131
violation_raw         0.058131
violation             0.058131
stop_outcome          0.058131
is_arrested           0.058131
stop_duration         0.058131
driver_age_raw        0.058066
stop_date             0.000000
stop_time             0.000000
search_conducted      0.000000
drugs_related_stop    0.000000
dtype: float64

In [8]:
data.drop(['county_name'], inplace=True, axis=1)
data.head(3)

,stop_date,stop_time,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,01:55,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2005-01-18,08:15,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,2005-01-23,23:15,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [10]:
data.describe(include = ['object'])

,stop_date,stop_time,driver_gender,driver_race,violation_raw,violation,search_type,stop_outcome,is_arrested,stop_duration
count,91741,91741,86406,86408,86408,86408,3196,86408,86408,86408
unique,3768,1436,2,5,12,6,24,6,2,5
top,2012-01-11,11:00,M,White,Speeding,Speeding,Incident to Arrest,Citation,False,0-15 Min
freq,69,323,62895,62158,48463,48463,1219,77006,83479,69543

In [11]:
data.describe()

       driver_age_raw    driver_age
count    86414.000000  86120.000000
mean      1970.491228     34.011333
std        110.914909     12.738564
min          0.000000     15.000000
25%       1967.000000     23.000000
50%       1980.000000     31.000000
75%       1987.000000     43.000000
max       8801.000000     99.000000

In [15]:
count_age_20 = data[data['driver_age'] == 20].shape[0]
print(count_age_20 > 3000)

True

In [17]:
age_40_50 = data[(data['driver_gender'] == 'M') & (data['driver_age'] >= 40) & (data['driver_age'] <= 50)].shape[0]
print(age_40_50/len(data))

0.12468798029234475

In [19]:
from sklearn.datasets import load_iris
load_iris = load_iris()
iris = pd.DataFrame(data = load_iris.data, columns=load_iris.feature_names)
rows, columns = iris.shape
print(rows, columns)

150 4

In [20]:
iris.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [21]:
iris.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [23]:
iris['target'] = load_iris.target
iris['target'] = iris['target'].map(lambda x: load_iris.target_names[x])

species_counts = iris['target'].value_counts()


print("Количество цветков каждого вида:")
print(species_counts)

Количество цветков каждого вида:
target
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [24]:
iris.isnull().sum()

sepal length (cm)    0
sepal width (cm)     0
petal length (cm)    0
petal width (cm)     0
target               0
dtype: int64

In [25]:
iris.drop_duplicates()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica
146,6.3,2.5,5.0,1.9,virginica
147,6.5,3.0,5.2,2.0,virginica
148,6.2,3.4,5.4,2.3,virginica
149,5.9,3.0,5.1,1.8,virginica

In [2]:
print(sum(range(5),-1))
from numpy import *
print(sum(range(5),-1))
# во втором варианте "-1" означает ось. тут она и так одна, поэтому не влияет. и все суммируется без -1

9
10

In [1]:
import numpy as np

Z = np.arange(1, 8)

In [10]:
2 << Z >> 2

array([ 1,  2,  4,  8, 16, 32, 64])

In [13]:
np.array([np.nan]).astype(int).astype(float)

/var/folders/50/18ts1bh12532xjz2xv95cl540000gn/T/ipykernel_57830/699728972.py:1: RuntimeWarning: invalid value encountered in cast
  np.array([np.nan]).astype(int).astype(float)

array([0.])

In [2]:
np.sqrt(-1) == np.emath.sqrt(-1)

/var/folders/50/18ts1bh12532xjz2xv95cl540000gn/T/ipykernel_64333/244602691.py:1: RuntimeWarning: invalid value encountered in sqrt
  np.sqrt(-1) == np.emath.sqrt(-1)

np.False_

In [9]:
np.datetime64('tomorrow')

ValueError: Error parsing datetime string "tomorrow" at position 0